---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksColorByObject
source: html/e2ca2580-f099-d19f-304f-4a77f5c59e43.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFlecksColorByObject Property

The property labeled "Color By Object" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintFlecksColorByObject { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".